In [2]:
import pandas as pd
import numpy as np

In [10]:
a = pd.Series([10.5,12.5,14.5,6.5])

In [11]:
print(a)

0    10.5
1    12.5
2    14.5
3     6.5
dtype: float64

In [6]:
m = pd.Series([10.5,12.5,14.5,6.5], name = "height")

In [7]:
print(m)

0    10.5
1    12.5
2    14.5
3     6.5
Name: height, dtype: float64

In [8]:
n = pd.Series([10.5,12.5,14.5,6.5], name = "height",index=["a","b","c","d"])

In [9]:
print(n)

a    10.5
b    12.5
c    14.5
d     6.5
Name: height, dtype: float64

In [12]:
n.values

array([10.5, 12.5, 14.5,  6.5])

In [14]:
n.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [31]:
population = {"Pydata": 6,"Python":15,"Gen-Data":12}

In [32]:
type(population)

dict

In [33]:
total_students = pd.Series(population)

In [34]:
total_students

Pydata       6
Python      15
Gen-Data    12
dtype: int64

In [35]:
total_students.index

Index(['Pydata', 'Python', 'Gen-Data'], dtype='object')

DataFrame

In [52]:
total_students

Pydata       6
Python      15
Gen-Data    12
dtype: int64

In [59]:
average_scores = {"Pydata": 40,"Python":21,"Gen-Data":16}

In [60]:
type(average_scores)

dict

In [61]:
average_scores

{'Pydata': 40, 'Python': 21, 'Gen-Data': 16}

In [62]:
school = pd.DataFrame({"total_students":population,"mean":average_scores})

In [63]:
print(school)

          total_students  mean
Pydata                 6    40
Python                15    21
Gen-Data              12    16

In [64]:
school.index

Index(['Pydata', 'Python', 'Gen-Data'], dtype='object')

In [65]:
counties = {"Name":["Nairobi","Mombasa","Nyeri"],
            "HQ":["CityHall","Bamburi","Kagumo"]}

In [68]:
d = pd.DataFrame(counties)
print(d)

      Name        HQ
0  Nairobi  CityHall
1  Mombasa   Bamburi
2    Nyeri    Kagumo

In [69]:
d

      Name        HQ
0  Nairobi  CityHall
1  Mombasa   Bamburi
2    Nyeri    Kagumo

In [90]:
counties1 = {"Name":["Nairobi","Mombasa","Nyeri"],
            "HQ":["CityHall","Bamburi","Kagumo"],
            "Size":[20000,2400,3000]}

In [91]:
d1 = pd.DataFrame(counties1)

In [92]:
d1

      Name        HQ   Size
0  Nairobi  CityHall  20000
1  Mombasa   Bamburi   2400
2    Nyeri    Kagumo   3000

Basic Exploration

In [93]:
d1.head()

      Name        HQ   Size
0  Nairobi  CityHall  20000
1  Mombasa   Bamburi   2400
2    Nyeri    Kagumo   3000

In [94]:
d1.head(2)

      Name        HQ   Size
0  Nairobi  CityHall  20000
1  Mombasa   Bamburi   2400

In [95]:
d1.tail()

      Name        HQ   Size
0  Nairobi  CityHall  20000
1  Mombasa   Bamburi   2400
2    Nyeri    Kagumo   3000

In [96]:
d1.tail(2)

      Name       HQ  Size
1  Mombasa  Bamburi  2400
2    Nyeri   Kagumo  3000

In [97]:
d1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   HQ      3 non-null      object
 2   Size    3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [98]:
d1['Size'] = pd.to_numeric(d1['Size'])

In [99]:
d1.describe()

               Size
count      3.000000
mean    8466.666667
std     9992.663976
min     2400.000000
25%     2700.000000
50%     3000.000000
75%    11500.000000
max    20000.000000

In [100]:
d1.shape

(3, 3)

In [101]:
d1.size

9

In [102]:
d1.columns

Index(['Name', 'HQ', 'Size'], dtype='object')

In [103]:
d1.index

RangeIndex(start=0, stop=3, step=1)

In [104]:
d1.dtypes

Name    object
HQ      object
Size     int64
dtype: object

Indexing and Selection

In [105]:
d1

      Name        HQ   Size
0  Nairobi  CityHall  20000
1  Mombasa   Bamburi   2400
2    Nyeri    Kagumo   3000

In [106]:
d1["Name"]

0    Nairobi
1    Mombasa
2      Nyeri
Name: Name, dtype: object

In [109]:
d1["Size"]

0    20000
1     2400
2     3000
Name: Size, dtype: int64

In [110]:
d1[["Name","HQ"]]

      Name        HQ
0  Nairobi  CityHall
1  Mombasa   Bamburi
2    Nyeri    Kagumo

In [112]:
d1.iloc[1]

Name    Mombasa
HQ      Bamburi
Size       2400
Name: 1, dtype: object

In [121]:
d1.iloc[0:,0:2]

      Name        HQ
0  Nairobi  CityHall
1  Mombasa   Bamburi
2    Nyeri    Kagumo

In [122]:
d1

      Name        HQ   Size
0  Nairobi  CityHall  20000
1  Mombasa   Bamburi   2400
2    Nyeri    Kagumo   3000

In [126]:
d1[d1["Size"]>2500]

      Name        HQ   Size
0  Nairobi  CityHall  20000
2    Nyeri    Kagumo   3000

In [128]:
d1[(d1["Size"]>2500) & (d1["Size"]<5000)]

    Name      HQ  Size
2  Nyeri  Kagumo  3000

Loc: Uses labels and not index
You have to set thr label you want to use as the index

In [ ]:
d1.loc